# Parameter Type Id View Position Property

Source: https://www.revitapidocs.com/2026/7fee73da-6885-4643-0891-c8f75d092118.htm

---

| Parameter Type Id View Position Property |
| --- |

"Saved Position"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ViewPosition { get; }
```

```
Public Shared ReadOnly Property ViewPosition As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ViewPosition {
	ForgeTypeId^ get ();
}
```

```
static member ViewPosition : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace